[
  {
    "date": "2021-03-14",
    "title": "Initial release",
    "description": "Hello! It's has been a busy week coding the skeleton of the web-site with React and trying to have something that work. Good news is it's done and it works properly! Now it's time to improve and write some articles."
  },
  {
    "date": "2021-03-16",
    "title": "Goodbye CSS ...",
    "description": "I just discovered that Bootstrap provides pre-defined classnames that can set margin / padding without putting any CSS styles and be responsive at the same time! No need to say I updated the entire components and reduced the amount of CSS by a lot."
  },
  {
    "date": "2021-03-21",
    "title": "New article: Spring-boot-jwt-ready",
    "description": "I'm kind of proud of this article because it summarizes lot of work done under the hood to have a spring-boot application that manage JWT out of the box. Moreover it includes Undertow, JPA, global error handling and more ... I'm happy :)"
  },
  {
    "date": "2021-03-21",
    "title": "New feature: table of contents in articles",
    "description": "After hours of Googling I didn't find the secret receipt that will work with my current Markdown implementation. Still there is a way to add custom anchor when a header is displayed so I made a small computation of that, pushing every anchor in the reducer when the article has one; React doesn't like the solution because it dispatch action during rendering, will see later how to do that better."
  },
  {
    "date": "2021-03-22",
    "title": "New feature: article count of views",
    "description": "When reading an article the web-site will increase by one (if never read before) or get the count of views of the article. Every others current online users will be notified by websocket of the change in realtime. The web-site will remember if the article has been read before or not by storing a value in thr browser local storage."
  },
  {
    "date": "2021-03-22",
    "title": "New feature: websocket + article",
    "article": "websocket-redux-saga",
    "description": "The web-site will connect to the API websocket service with the possibility to retry after a delay for an amount of max attempts. This feature uses a classic javascript websocket object embedded inside a redux/saga."
  },
  {
    "date": "2021-03-22",
    "title": "Update web-site design",
    "description": "After watching some Youtube videos it becomes clear that the site need some kind of makeover in term of UI/UX because it looks to much like default Bootstrap design. It's done, with new font, reworked header, a dedicated About page + news feed, rework article structure and more ..."
  },
  {
    "date": "2021-03-25",
    "title": "Add GraphQl support + article",
    "article": "micronaut-graphql-react",
    "description": "Proof of concept that the API can be used with GraphQL queries/mutations from the front-end using Apollo/Client. The result is satisfying and highlights this fact: using Hooks (context) + GraphQL may nullify the need of Redux + Saga. To be remember for my next React project."
  },
  {
    "date": "2021-03-28",
    "title": "Google Cloud App Engine + article",
    "article": "micronaut-app-engine",
    "description": "Time to play with the (limitless?) cloud features starting with Google Cloud. My plan is to migrate the existing Heroku API into App Engine using Firestore as database instead of PostgreSQL and see how to replace the websocket if possible."
  }
]
